# ---------file for all text-constants-----------
WELCOME = "Добро пожаловать в чат-бота 'Деловое знакомство'🤝\n" \
          "Для доступа необходимо ввести инвайт-код📝, которым поделился Ваш друг."

WELCOME_HAS_ACCOUNT = "Добро пожаловать в чат-бота 'Деловое знакомство'🤝\n" \
                      " У Вас уже есть аккаунт, можете просмотреть свою анкету."


DONT_SHOW = 'Я больше не хочу никого искать 😴'


CHECK_INVITE = "Вы ввели действительный код."
NOT_CHECK_INVITE = "Вы ввели недействительный код."


ERROR_KEYBOARD = "Выберите один из вариантов на клавиатуре."


AGREEMENT_MESSAGE = "Необходимо принять соглашение, чтобы пользоваться данным ботом."


AGREE = "Принять✅"
DISAGREE = "Отказаться❌"

AGREEMENT_ACCEPTED = "Соглашение принято ✅"
AGREEMENT_NOT_ACCEPTED = "Вы не приняли соглашение, поэтому не сможете пользоваться ботом.\n" \
    "Пожалуйста, примите соглашение и повторите попытку."

CREATE_ACCOUNT = "Теперь необходимо заполнить анкету. Введите Ваше имя."


NAME_ERROR = "Имя должно содержать от 2 до 30 символов. А так же не должно содержать специальных символов и пробелов."
# NAME_ACCEPTED = "Имя принято ✅. Теперь необходимо выбрать пол."
NAME_ACCEPTED = "Имя принято✅. Расскажите немного о себе (Ваши интересы, чем любите заниматься свободное время, какие фильмы любите смотреть и т.д.)."

DESC_ERROR = "Описание должно быть не более 200 символов."
DESK_ACCEPTED = "Запомнили информацию. Укажите Ваш город."

WOMAN = "Женщина"
MAN = "Мужчина"

GENDER_ACCEPTED = "Расскажите немного о себе (хобби, цели, взгляд на жизнь и тп.)."


LOCATION_ERROR = "Город не найден в России. Попробуйте ввести ближайший к Вам город."
LOCATION_ACCEPTED = "С городом определились. Осталось отправить фото."


PHOTO_ACCEPTED = "Фотография загружена. Анкета полностью заполнена ✅"


GET_FORM = "Посмотреть анкету."
EDIT_FORM = "Редактировать анкету 📝"

FORM_INFO = "Выберите, что хотите поменять."


CHANGE = "Изменить"

NAME = "Имя"
GENDER = "пол"
LOCATION = "Город"
DESCRIPTION = "Описание"
LINK_PHOTO = "Фото"


NEW_NAME = "Введите новое имя:"
NEW_NAME_EDIT = "Имя изменено."

NEW_GENDER = "Выберите пол"
NEW_GENDER_EDIT = "Пол изменён"

NEW_LOCATION = "Введите новый город:"
NEW_LOCATION_EDIT = "Город изменён."

NEW_DESCRIPTION = "Введите описание:"
NEW_DESCRIPTION_EDIT = "Описание изменено."


NEW_LINK_PHOTO = "Отправьте фото."
NEW_LINK_PHOTO_EDIT = "Фото изменено."


SHOW_USERS = "Смотреть анкеты 📃"
ACTIVE_FLAG = "Скрыть анкету 😴"
NOT_ACTIVE_FLAG = "Открыть анкету 🔑"
INVITE = "Invite код 📨"

LOVE_USER = "🤝"
SKIP_USER = "⛔"


PAUSE_INFO = "Показ анкет приостановлен."
SKIP_INFO = "Следующая анкета."
MEETING = "Пользователь тоже обратил внимание на Вашу анкету! Приятного общения!"
SKIP_USER_MESSAGE = "Пользователь пропущен."
WAIT_FOR_LIKE = "Ожидайте, пользователь пока не добрался до Вашей анкеты. Как только он увидит её, мы Вам сообщим."

NOT_ENOUGH_USERS = "Вы исчерпали лимит на сегодня. Попробуйте позже."
