# ---------file for all text-constants-----------
WELCOME = "Добро пожаловать в чат-бота для знакомств.\n" \
          "Для доступа необходимо ввести инвайт-код от друга, который Вас пригласил"

WELCOME_HAS_ACCOUNT = "Добро пожаловать в чат-бота для знакомств.\n" \
                      " У Вас уже есть аккаунт, можете просмотреть свою анкету."

INVITE_INFO = 'Введите пригласительный код, чтобы воспользоваться ботом.'

NAME_INFO = 'Ваше полное имя? '

CITY_INFO = 'Из какого Вы города? '

DESK_INFO = 'Расскажите максимально подробно о себе (ваши интересы, чем любите ' \
            'заниматься в свободное время, какие фильмы любите смотреть и т.д'

IMG_INFO = 'Загрузите фотографию'

MENU_1 = 'Смотреть анкеты'
MENU_2 = 'Мои анкета'
MENU_3 = 'Я больше не хочу никого искать'
MENU_4 = 'Пригласи друзей и коллег'

ANSWER_LIKED_WOMAN = f'Вы понравились девушке, показать её?  '
ANSWER_LIKED_MAN = f'Вы понравились парню, показать его?  '

SHOW = "Показать"
DONT_SHOW = MENU_3


CHECK_INVITE = "Вы ввели действительный код"
NOT_CHECK_INVITE = "Вы ввели недействительный код"


AGREEMENT_MESSAGE = ""  # TODO: подготовить сообщение о принятии соглашения


AGREE = "Принять"
DISAGREE = "Отказаться"

AGREEMENT_ACCEPTED = "Соглашение принято"
AGREEMENT_NOT_ACCEPTED = "Вы не приняли соглашение, поэтому не сможете пользоваться ботом.\n" \
    "Пожалуйста, примите соглашение и повторите попытку."

CREATE_ACCOUNT = "Теперь необходимо заполнить анкету"


NAME_ERROR = "Имя должно содержать от 2 до 15 символов. А так же не должно содержать специальных символов и пробелов."
NAME_ACCEPTED = "Имя принято. Теперь необходимо ввести фамилию"
